# Формат ввода
# Вводится целое неотрицательное число N (N≤100).
# Формат вывода
# Выведите 2ᴺ.

power = int(input())

print(2 ** power)
