# Дано натуральное число. Выведите его последнюю цифру.
# Формат ввода
# Вводится единственное целое неотрицательное число (гарантируется, что оно не превышает 10000).

value = int(input())

print(str(value)[-1:])
