# Дано двузначное число. Найдите число десятков в нем.
# Формат ввода
# Вводится единственное число (гарантируется, что оно соответствует условию задачи).


value = int(input())

print(str(value)[:-1])
