# Дано положительное действительное число X. Выведите его дробную часть.

# Формат ввода
# Вводятся положительное действительное число.

# Формат вывода
# Выведите ответ на задачу.

value = float(input())

print(value % 1)
